[
    {
        "id": 1,
        "author": "Abood",
        "title": "Mac Pro",
        "content": "He is a pro dfsdj sdjfsjsdj djjdjd nvdnvn Qualified Purchasers receive an Apple Gift Card when they purchase an eligible Mac or iPad at a Qualifying Location through 10/2/23. Only one Apple Gift Card per eligible Mac or iPad per Qualified Purchaser. Offer subject to availability. While supplies last. Qualified Purchasers shall receive a discount equal to the value of the Apple Gift Card off the price of the eligible Mac or iPad, but will be charged for all items in their cart, including the Apple Gift Card. Important notice regarding the checkout receipt and monthly statement for Apple Card Monthly Installments (ACMI) purchases with this promotion: Qualified Purchasers selecting ACMI (a 0% APR payment option available only in the U.S.) as payment type at checkout shall receive a discount equal to the value of the Apple Gift Card off the price of the eligible Mac or iPad. This will result in one ACMI installment plan over 12 months for the eligible iPad or Mac discounted by the instant credit, and a second ACMI installment plan over 12 months for the full price of the Apple Gift Card. The total combined amount charged over the two separate ACMI installment plans will reflect the original full retail price of the Eligible Product. Separately, Qualified Purchasers will receive and be charged for the Apple Gift Card in the amount of the applicable discount off the eligible Mac or iPad. ACMI is subject to credit approval and credit limit. Variable APRs for Apple Card other than ACMI range from 15.99% to 26.99% based on creditworthiness. Rates as of June 1, 2023. If you choose the pay-in-full or one-time-payment option for an ACMI-eligible purchase instead of choosing ACMI as the payment option at checkout, that purchase will be subject to the variable APR assigned to your Apple Card. Taxes and shipping are not included in ACMI transactions and are subject to your standard purchase APR. See the Apple Card Customer Agreement at https://www.goldmansachs.com/terms-and-conditions/Apple-Card-Customer-Agreement.pdf(Opens in a new window) for more information. ACMI is not available for purchases made online at the following special stores: Apple Employee Purchase Plan; participating corporate Employee Purchase Programs; Apple at Work for small businesses; Government, and Veterans and Military Purchase Programs, or on refurbished devices. Apple Card is issued by Goldman Sachs Bank USA, Salt Lake City Branch. Available for qualifying applicants in the United States. If you reside in the U.S. territories, please call Goldman Sachs at 877-255-5923 with questions about accessing this offer or applying for Apple Card. This offer cannot be combined with the Apple Employee Purchase Plan or business loyalty pricing. Additional restrictions apply. View full terms and conditions of offer here(Opens in a new window). ",
        "likes": 38
    },
    {
        "id": 3,
        "author": "Group of Apple Engineers",
        "title": "Python Programming",
        "content": "Python is a widely popular programming language known for its simplicity, readability, and versatility. It has gained a lot of traction among developers and has become a go-to language for various applications, including web development, data analysis, machine learning, and scripting.\r\n\r\nMany engineers appreciate Python for its clean syntax, which makes it easy to learn and understand, even for beginners. Its extensive standard library and a vast ecosystem of third-party packages contribute to its flexibility and efficiency in various domains.\r\n\r\nPython's popularity within the data science and machine learning communities is noteworthy. It offers powerful libraries such as NumPy, Pandas, and TensorFlow, which facilitate data manipulation, analysis, and modeling. These capabilities have made Python a preferred language for tasks related to artificial intelligence and scientific computing.\r\n\r\nApple engineers may value Python for its compatibility with macOS and iOS systems. Python is available on these platforms and can be used for scripting, automation, and building applications. Additionally, Python's integration capabilities with other languages and frameworks can be advantageous when working on projects that involve Apple's ecosystem.\r\n\r\nIt's worth mentioning that individual opinions among engineers can vary, and some may have different preferences or opinions based on their specific use cases, personal experiences, or project requirements.",
        "likes": 35
    },
    {
        "id": 4,
        "author": "sdafasdfas",
        "title": "gggggg",
        "content": "asdfasdfasdfasdfs",
        "likes": 21
    },
    {
        "id": 5,
        "author": "Ivana",
        "title": "Ivana",
        "content": "Python is a widely popular programming language known for its simplicity, readability, and versatility. It has gained a lot of traction among developers and has become a go-to language for various applications, including web development, data analysis, machine learning, and scripting. Many engineers appreciate Python for its clean syntax, which makes it easy to learn and understand, even for beginners. Its extensive standard library and a vast ecosystem of third-party packages contribute to its flexibility and efficiency in various domains. Python's popularity within the data science and machine learning communities is noteworthy. ",
        "likes": 29
    },
    {
        "id": 6,
        "author": "sdafasdfas",
        "title": "gggggg",
        "content": "asdfasdfasdfasdfs",
        "likes": 8
    },
    {
        "id": 7,
        "author": "سيبسشيبشسي",
        "title": "بذبسيش",
        "content": "سشيبشيسسيبشسيبسيبسشيبشسي",
        "likes": 1
    }
]